#У Python self — це звичайна назва першого параметру в методах класу, яка посилається на поточний екземпляр класу. Це дозволяє отримувати доступ до атрибутів і методів об'єкта всередині класу.

#__init__(self, name, age): self вказує на екземпляр класу, який створюється. За допомогою self ми прив'язуємо параметри name та age до атрибутів об'єкта.

#greet(self): Використовуємо self.name та self.age для доступу до атрибутів об'єкта, щоб сформувати привітання.

#Таким чином, self є посиланням на поточний об'єкт, що дозволяє методам класу працювати з його даними та іншими методами.


class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age
    
    def greet(self):
        print(f"Привіт, мене звати {self.name} і мені {self.age} років.")

# Створюємо екземпляр класу    
person = Person("Ruslan", 23)

person.greet() # Викликає метод greet()